[
{"title": "Attracting and retaining ‘Digital Natives’ in the finance industry", "author": "linker 5", "content": ["The impact of the global pandemic is not yet known, but many businesses have plans underway to recover, rebuild and eventually grow – including hiring. Digitally native talent is becoming increasingly sought after as business leaders become more aware of the importance of  data and analytical skills when it comes to business survival. Shockingly, research shows that ", ".", "Projecting the future of the business through financial forecasting is now one of the most critical business functions in the current climate, causing financial talent to be in high demand. The latest generation of young graduates enter the finance industry and begin their professional journey. However, their attention is notoriously hard to grasp. To attract, and importantly retain these young professionals, businesses must rethink their finance function to be considered as a potential employer for them.", "Despite the vast amount of people looking for jobs at the moment, attracting younger generations still has its challenges. In the accountancy sector, ", " that will need to be nurtured in order to attract them. But the good news is that this can be achieved by reflecting these attitudes across the business.", "Those looking to hire Gen Zers, need to understand that personal support and career development prospects play a major role when it comes to attracting and motivating this generation. Even though times are tough, it’s important for businesses to show young employees that they are invested in their future to make them feel valued and motivated. The initiative should be taken by finance teams and particularly the CFO. From the outset, employers should offer tailored training programmes to each new starter, that help to develop the core skills they need to fulfil their role, develop professionally and progress in the business.", "Generation Z are graduating from education and entering the workplace at a very uncertain time. Even as COVID measures wax and wane, ‘Generation Remote’ will expect a more flexible working environment, with the ability to work changeable hours and from the safety and convenience of their homes. A workplace culture that prioritises mental wellbeing and a work-life balance isn’t just a nice to have, but an expectation..", "Surprisingly, not all businesses have embarked on this flexible cultural change that has been encouraged as a result of the pandemic.  While it may be difficult, finance leaders should reconsider whether the traditional nine-to-five, desk-bound culture is still serving the business successfully. If not, they may be depriving themselves of valuable talent and could look to adopt a more flexible approach. Flexible working is no longer a ‘work perk’, it has now become a staple feature that is expected from businesses who want to attract the brightest talent.", "However, it doesn’t stop there. Generation Z want more than support in the workplace and flexible working initiatives. Innovative technology that supports and empowers employees in their roles is equally critical. The widespread use of old, disparate systems not only stifles agility and innovation – it can scare away young talent.", "Outdated technology is commonplace within businesses today, as many companies fail to prioritise the benefits that data and analytics can bring. Yet, spending valuable time training beginners on how to use outdated software is a costly process and is hardly an exciting activity for someone just starting in their role.", "By nurturing a tech-savvy environment with a focus on integration and productivity, businesses can equip young people with all the tools they need to achieve and thrive. Cloud-based technology provides access to the latest tools, meaning young workers don’t need to struggle with outdated technology. Instead, they can access systems whenever and wherever they want, effectively facilitating  today’s remote working world.", "In this way, the introduction of new technology has a cyclical effect on innovation. New technology attracts new talent, which in turn brings more fresh ideas, perspectives and capabilities to a business. This is especially true of artificial intelligence where we can see ", ".", "Employing a finance team who are fresh out of education allows your business to utilize the latest technology and tools that appeal to their generation and come so naturally to them. With this comes the rise of the ‘intelligent organisation’ – one able to leverage technology to understand and make optimal decisions based on integrated data insights. Ongoing visibility into the state of the business enables employees to be more adaptable and to grasp new practices when necessary, this is vital when the pace of change is moving quickly.", "Young people have always sat at the center of society, influencing trends both inside and outside of the workplace. The skills within the Gen Z bracket are now more crucial than ever whether it is implementing cloud-based solutions, digitising workflows or finding technical solutions. Attracting and retaining talent amongst the latest graduates adds real value, encouraging businesses to keep up with the pace of evolving technology and client demands."]},
{"title": "FPT Software Showcases Digital Capabilities at Tech-Infused Event", "author": "Staff GBAF Publications Ltd.", "content": ["HANOI, Vietnam – July 25, 2022 – Vietnam’s leading IT company FPT Software, a subsidiary of FPT Corporation (FPT), recently welcomed 550 guests worldwide to the Tech Exhibition on July 20, 2022. The event was organized to celebrate the grand opening of FPT’s latest headquarter in Hanoi, demonstrating the company’s world-class tech capabilities and affirming its commitment as a complete IT solutions provider.", "Titled “Thrive in the new future”, the event included a tech conference with the participation of leaders and experts from global companies such as Accenture, Schaeffler, SAP, Toshiba, Standard Chartered, and a tech exhibition showcasing FPT Software’s digital capabilities in Artificial Intelligence, Intelligent Automation, Cloud & Analytics, Cybersecurity, Metaverse, Blockchain, just to name a few.", "Virtual MC, virtual campus tour, AI-generated paintings were some real-world applications of those technologies presented during the event and attracted much attention from the participants.", "\n“Today’s tech expo demonstrates key trends I see in the market, particularly around the idea of becoming a human-centered service provider”, said Forrester’s Principal Analyst Sam Higgins during a panel discussion with FPT executives. He mentioned the concept of ‘future fit’ organizations being ones with a clear vision around platforms, practices and partnerships. “Much of what we saw in the event were examples of how to embody a principle of future fit in the relationship between a service provider and customers. I think that is outstanding for the region”, Sam noted.", "At the event, FPT Software introduced its complete IT solutions including managed services, consulting services, backed by a dynamic workforce of 25,500 staff, optimal working models of best-shore, nearshore and onsite, and an ecosystem of internal startups.", "Themed a voyage, the event reenacted the global expansion journey of FPT. After two decades, the company now has 58 international offices with a clientele of over 1,000 organizations worldwide.", "\nIn its next development phase, FPT claims to continue leveraging technologies to serve human, empower businesses and save jobs. FPT Chairman Dr.Truong Gia Binh unveiled how the company accompanies the future with three keywords, which are technology, people and commitment.", "“FPT has gone from an outsourcing company and become a complete IT solutions provider now”, said Binh. The company pledges to be a trusted partner for businesses in the digital future. “Uncertainty is the only certainty there is. In whatever uncertainties, FPT is always next to you”, he added.", "“We have been working together with FPT for two years…Lots of energy, lots of potential working with the Vietnamese team. I am looking forward to continuing our journey together”, said Thorsten Neumann, Standard Chartered Ventures’ Chief Technology Officer.", "FPT Software is part of FPT Corporation (FPT – HoSE) – the global leading technology and IT services group headquartered in Vietnam. FPT Software has more than USD 632.5 million in revenue and 25,500 employees in 27 countries and territories. As a pioneer in digital transformation, the company delivers world-class services in Smart factory, Digital platforms, RPA, AI, IoT, Cloud, AR/VR, BPO, and more. It has served 1,000+ customers worldwide, a hundred of which are Fortune Global 500 companies in the industries of Automotive, Banking and Finance, Logistics & Transportation, Utilities, and more. For further information, please visit ", "."]},
{"title": "Wealth Management Articles", "author": null, "content": []},
{"title": "Trends in FinTech in 2022: From artificial intelligence to financial wellness", "author": "maria gbaf", "content": ["The financial services industry has been pivoting towards digital transformation for the last decade or so.  The onset of COVID-19 pandemic has only heightened the importance of this transformation as the demand for digital solutions has rapidly grown.  The rise of fintechs and brands has also fostered the maturing digital landscape and changed customer expectations.", "As competition increases, it’s no longer enough to only offer financial products through digital channels. Surveys show that the main drivers for customer attrition are poor banking apps and a lack of digital services, so the financial services industry needs to embrace new strategies and technologies with a renewed focus on the customer context (experience and engagement) and provide enhanced digital experiences to retain and acquire new customers.  Here are seven trend predictions for 2022 and beyond:", "According to Forrester Research, in 2022, it’s predicted that a quarter of banks will increase their tech spending by 10% or more. Banks must invest in and build an infrastructure that facilitates their digital transformation and helps them provide an exceptional customer experience with digital intelligence and automated decisioning. This includes increased investment into the adoption of the micro-service and API layers that allow for seamless integration into digital platforms and ecosystems.", "The digital experience is now the primary driver of customer attrition and it’s a major factor for consumers when it comes to choosing a bank. To stay competitive, banks need to deliver an attractive and comprehensive digital experience that works in parallel with their physical branch and call centre services. Business must look at the entire customer journey from end to end – from fast and seamless onboarding to real-time notifications with personal and relevant messaging, offering products relevant to the customer life cycle, well integrated self-service tools, enhanced security and fraud protection, and also offer insights for customers.", "In order to leverage the digital decision platforms and logic that helps with decision making, there must be an increased focus on data-driven decision intelligence technologies, such as machine learning and AI. Many institutions are moving to a hybrid human and AI decision-making model to compose a full view of the customer, which enables customer life cycle management with intelligent, relevant and timely decisions. According to the International Data Corporation, global spending on AI systems is forecast to jump from $85.3 billion in 2021 to more than $204 billion in 2025. The compound annual growth rate (CAGR) for the 2021-2025 period will be 24.5%.", "To leverage the vast amount of data available, companies must be able to define, map, analyse, and use this data to create customised digital experiences with personal and relevant messaging and offers that customers want. Data responsibility will become increasingly important with the rise of data aggregation.  Banks must balance the power of data with responsible AI, keeping in mind the importance of ethics, transparency, and security. Consumers are also more data aware with a maturing understanding of how their data could be exposed and used.  This causes them to be more risk averse when it comes to giving out their data without a clear return.  Banks will need to provide data value such as data insights for enhanced risk assessment or fraud protection, to empower customers with their own data, which in turn could give them better engagement and personalisation.", "A bank’s bottom line relies on the financial wellness of its customers, thus a focus on the financial health of customer should be a primary strategic goal. Having access to financial services does not necessarily mean they’re financially healthy. The younger generations may be more digitally savvy, but they aren’t financially savvy. What this means for banks is that there’s a renewed need to understand their customers’ life cycles, and their journey, be able to empathise with them, anticipate their needs, and deliver products/services to help them improve their financial wellbeing at the point of need – allowing their customers to feel financially secure. Studies show that putting their customers’ financial wellness at the centre will help banks grow profitable portfolios and increase long-term shareholder value.", "Environmental, social and governance (ESG) considerations are gaining importance. Some regulators are proposing that climate reporting by banks be made mandatory. The ESG transition will need banks to balance business while embracing and implementing ESG-related policies and standards. Financial services firms will be keen to accelerate their speed to market for ESG products and services, such as green loans and mortgages, and checking accounts with sustainability and carbon-tracking features.", "With regulators in the EU and UK proposing measures to extend data sharing principles across financial and nonfinancial products, 2022 will see a growing number of banks experimenting and pivoting their business models toward a more open, collaborative platform approach. Leveraging this open-banking connectivity and focusing their efforts on delivering select capabilities as a service, powering the growth of embedded finance. This all goes back to the focus on the customer, and being able to provide financial products, features, services and education at the point of the customer need, and not through a separate journey."]},
{"title": "Research on Digital Transformation Management Consulting Market Research Report with Opportunities and Strategies to Boost Growth- COVID-19 Impact and Recovery", "author": "Reports Markets", "content": ["On the basis of types, the Digital Transformation Management Consulting market is primarily split into:", "\nInventory Operations", "\nSupply Chain Management", "\nCustomer Service Operations", "\nProduct/Software Digitalization", "\nFreight Booking", "\nIn-Store digitization", "\nAdvanced Payment Options", "\nDigital Marketing Techniques", "\nOthers", "On the basis of applications, the Digital Transformation Management Consulting market covers:", "\nTechnology", "\nStrategy", "\nHuman Resources", "\nOther Services"]},
{"title": "How Artificial Intelligence Enhances Customer Experiences in Banking", "author": "Staff GBAF Publications Ltd.", "content": ["Since the concept of banking first sprung up around 8000 BC, banks and financial institutions have gone through various drastic changes to expand their services, innovate their business models to offer better products and services and, most important of all, improve the customer experience. Today, Artificial Intelligence (AI) and Machine Learning (ML) are applied to help banks and financial institutions improve customer satisfaction – one of the most important factors to drive a bank’s success. ", " showed that 77% of banking executives believe that the use of AI will ultimately differentiate between winning and losing banks.", " has triggered a sudden socioeconomic shift from physical to digital, both for consumers and businesses. Consumers are rapidly switching to digital channels. Unsure about how the pandemic might evolve, they are uncertain about what to buy. This means businesses can no longer rely on historical data and traditional ways of predicting future purchasing patterns.", "At the same time, ", ", conducted on behalf of IBM in June 2021, revealed that digital services have become the de facto way of conducting business and access services during the COVID pandemic. Around half of those surveyed aged 18-24 (54%) and 25-34 (50%) would welcome the use of technologies such as AI if they improve services and create personalised interactions.", "EIU’s survey revealed that enhancing the user experience through better personalisation ranked first in the most valuable uses of AI, followed by customer fraud detection, digital marketing and product development.", "Done right, personalisation is much more than merely addressing the customer by their name or sending them birthday wishes. Instead, it consists of tailoring all communication, products and services offered to each customer’s current situation and individual requirements. Customer propositions are no longer fit-for-all, they must be intelligent and tailored, involving both banking and non-banking products and services.", "To identify the customers’ needs and deliver such intelligent propositions, banks must take an entirely new approach to innovation. They must move away from a product-centric approach where they develop new products and push them to customers. Instead, they should adopt a customer-centric view, which starts with understanding customer needs to deliver both the bank’s own products and their partners’ products and services in real time. This requires AI and analytics capabilities.", "AI makes it much easier to analyse customer preferences, allowing banks to provide relevant offers or recommend suitable products before customers even recognise their own needs. Banks are more likely to gain their customers’ trust and loyalty if they can customise the banking experience in this way.", "Among the most prominent use cases that benefit customers are budgeting tools for saving and goal planning, fee reductions, partner discounts, early fraud detection, loyalty points, new value propositions and non-banking services.  The redesigning of customer loyalty programmes gives banks a deeper and more accurate understanding of customer context, behaviour, needs and preferences.", "Based on this, effective personalisation offers customers not only better leads but also a more unique experience. For example, based on a customer’s health and fitness activities, they could receive a discounted offer for health insurance alongside discounted coupons to buy health products if they purchase them using the bank’s credit card.", "Improving the customer experience by applying AI requires integrated capabilities. Banks must therefore take an API First, Data First and AI First approach. The goal is to understand how customers engage with the bank, both for banking services and non-banking services, to adopt a holistic data-driven approach. Banks must also build out their capabilities to strike new partnerships at scale with non-financial services institutions.", "Businesses across all industries are working hard to retain their customers, and banks are no exception. AI can become a banking institutions’ superpower: applied in the right way, it can take the customer experience to new heights, resulting in happier and more loyal customers. At the same time, it will reduce a bank’s operating costs and enable increased revenue per customer.", "To become AI First, banks must focus on streamlining their technology layer so they can provide customers with distinctive omnichannel experiences, provide personalisation and drive rapid innovation.", "They also require a clear strategy on how to engage customers through channels owned by them and their non-banking partners. Banks must adopt a design-thinking lens as they build experiences within and beyond banking to enable true tailoring and personalisation for customers, reengineering back-end processes, and ensuring that data is captured at every step. The solution is not just to implement the right technology: Instead, business and technology must work hand in hand, with cross-functional teams breaking up organisational silos to improve the overall customer experience."]},
{"title": "Can RPA keep the lights on in the high street?", "author": "Staff GBAF Publications Ltd.", "content": ["High street retailers have been struggling for most of this century. Now accentuated by COVID, facing a potential profit loss of 11billion euros between 2019 and 2025 in key European markets, retail trades plummeted: trading activities in the UK were 20% down from February to April 2020, France 27%, Spain and Italy 33% and US 16%. The COVID pandemic forced many to close their doors to customers, some never to open again, but it also made many rethink their online offering and a few to take a step back and re-evaluate their high street offering too. As recovery begins, there are many uncertainties, not least future outbreaks of COVID mutations, faltering consumer confidence, changes in the structure and practices of the labour market and stumbling recovery of the global supply chain. Those that are most likely to survive and thrive online and on the high street are almost certainly implementing Robotic Process Automation (RPA). Not humanoid robots on the tills but software technology that makes it easy to build, deploy, and manage software robots that emulate human actions, interacting with digital systems and software, especially those having multiple manual, labour-intensive routine operations. The adoption of RPA offers quick, cost-effective benefits, from the reduction of, particularly, back-office employees, costs, risks, and errors to create significantly higher efficiency.", "With all the pandemic-related uncertainty, it seemed unlikely that the biggest immediate problem for retail would be staffing. Yet, according to Deloitte’s 2022 retail industry outlook, 83% of retailers are investing most heavily in employee recruitment and retention, finding the issues go far deeper than merely salaries as priorities have shifted for employees. With over one million retail jobs unfilled according to the same Deloitte report, now would seem to be a good time to look at how the business could be managed with a much smaller workforce and the highest possible priority given to customer facing employees and the support they need for maximum effectiveness.", "It may come as a surprise that 40% of business activities can be automated, so there are many areas where retailers can apply ", ". Customer service staff are usually burdened with routine tasks that can easily be automated using RPA, for example, inventory management is a back-office procedure that can be extremely labour-intensive, while Bots can pick up order details automatically, add them to the database and send an auto-generated confirmation email to the concerned stakeholder. In the same way, Bots can reconcile delivery notes with invoices, monitor stock levels and execute predetermined reorder instructions plus a host of other simple routine activities in purchasing, warehouse, store management, accounting and finance, logistics, human resource management, customer service and IT. One of the great things about Bots is that they can operate application programming interfaces (APIs) independently, so RPA solutions can act as an intermediary between new and old systems. They can talk to both legacy software systems and new software. RPA bots can also harmonize SKU data from multiple markets to be able to look beyond numbers to insights, automating the process to save thousands of hours of work.", "The pandemic has accelerated changing consumer behaviour as they move to an omnichannel shopping experience: browse online, buy in-shop or vice versa; order online collect in shop; order in shop for delivery; check what’s local on mobile; use price comparison sites and check out top buy listings. Consumers have no barriers between high street shopping and online shopping, unlike too many retailers, who run them as separate businesses and often set them in competition with each other, instead of seeing how one can attract business to the other and push for complementary purchases or impulse buys. One of the factors in failing to homogenise the business is that high street often has legacy systems that can’t talk to the newer software running online businesses. As mentioned above, this is simple to address with Bots that can interface between the two. Of course, there are other factors: the sudden shift in operating model that saw 70% of respondents reporting shopping online more often and retailers rushing to digital with increased investment in online platforms, whilst costs of physical stores remained unchanged.  Retailers may operate on a lower margin (3.7% forecast for the European market by 2025) but pure online retailers run on even thinner margins (average 1.4% in the EU) so these online specialists were given an edge by the pandemic, with some entering the super 25 (those accounting for 90% of the retail sector’s market-cap increase). Juggling all of this requires more data, analysed more quickly, providing more clarity of impacts; all of which can be provided by RPA at very low relative cost. Bots, for instance, can generate reports that give visibility to the performance of promotions in real time, ensure that stock is where it needs to be and that reorders are timely. Some retailers rely on legacy systems for stock keeping; RPA bots can perform constant checks on these systems providing data on key metrics like items with low stock levels or rapidly changing stock levels.", "Call centres are at the heart of many aspects of customer service and Bots can provide support to customer service staff: Bots can immediately route the call to the appropriate support call centre agents by pulling out customer data, purchasing history or any other information needed, thus reducing average call handling time. In addition, bots can trigger specific actions after a call request is completed. Enhanced bots, Chatbots, are available 24/7/365, can answer all calls instantly, are a single point of contact (no drilling down through a menu of options) and provide instant accurate responses based on any information that is in the databases to which they have access. Mordor Intelligence forecasts that the chatbot market, valued at USD 17.17 billion in 2020, will reach USD 102.29 billion by 2026, a CAGR of 34.75% over the forecast period. According to Salesforce, 69% of consumers prefer to speak to chatbots for the speed at which they can communicate with a brand. According to MIT technology review, 90% of businesses reported faster complaints resolution with chatbots. Chatbots can simulate a conversation (or a chat) with a user in natural language through messaging applications, websites, mobile apps, or the telephone.", "However, if you add artificial intelligence (AI) and machine learning ML) you move the project to the level of  hyper automation and, in many processes, it can replace the human element almost entirely. “", "Among the most impactful workflow and productivity tools, Hyper Automation is changing the game by enabling most manual tasks to be automated in just minutes; such as, collecting customer data or enquiry from many sources; classifying, allocating to related departments; solving customers’ problems. These combination tools will leverage customer service to the next level of speed and quality. Hyper Automation is  enhancing end-customer experience along three main themes: supporting businesses to provide ‘WOW services’ by solving customers’ problems in minutes; accelerating business operation optimization by providing customers the right answer from the right helpers in the quickest time; facilitating customers to help themselves through personalized supporting guidelines or virtual agents. Retailers can stay on top of customer satisfaction with automation and prioritization through systems that enrich the common issue-solving library. Staff have more time to focus on challenging tasks and uncommon issues. Automation also collects, analyses and predicts events that make customers unhappy and solves them, often by stopping them happening at all.", "RPA offers higher business agility and a fast return on investment. However, despite widespread global adoption, EY research reveals that 30 to 50% of initial RPA projects fail, with the common reason being the poor preparation for the automation journey. In order to develop a plan it is vital for businesses to develop a thorough understanding and comprehensive evaluation of their needs and readiness. The IT requirements review should consider technical support, maintenance, security and data standards, hardware and software, licensing fees and implementation costs. A proof-of-concept (PoC) engagement can help an enterprise to achieve a clearer observation on the targeted automation solution by allowing the team in charge to see whether it will work in the confines of business’s customized environment. A POC can be conducted quickly with little investment and minimal technology process expertise, therefore it is a great way to fully assess and start an enterprise-wide automation program. The RPA technology creates a digital workforce working side-by-side with human employees to streamline operations and accelerate business activities, success depends on people adopting and adapting. According to KPMG, RPA implementation can lead to operational cost reductions of up to 75%.", "Bots can be configured to track data migration as it happens and can therefore spot any anomalies or low-quality data, and rectify the errors in real-time; one Bot, in this context, equates to 100 manual testers, enabling rigorous system testing with little time and effort and minimal errors before the system goes live.  A penny saved is a penny earned with RPA as every reduction in costs goes 100% straight to the bottom line.    Retailers must optimize every resource. RPA through Bots, chatbots and hyper automation can reduce costs, improve efficiency and generate a better retail experience for staff and customers both online and in-store."]},
{"title": "Wealth Planning Articles", "author": null, "content": []},
{"title": "Share Class Articles", "author": null, "content": []},
{"title": "Cloud Banking: How Cloud Computing is Transforming the Financial Services Industry", "author": "Staff GBAF Publications Ltd.", "content": ["Many organisations in the global financial services industry have embarked on a cloud journey over the past five years. Even before the Covid pandemic hit, approximately ", ". This trend has accelerated notably in the past 12 to 18 months.", ", application modernisation is the most widely cited objective in banking and investing services. In the report, 70 percent of banking leaders stated that they expected their cloud spending to increase in 2022. While most banks currently rely on external service providers, Gartner’s survey indicates a future shift to cloud activities being owned by internal IT teams. Organisations have begun to build private clouds and establish their own data centres.", "These statistics show how banks and credit unions are increasingly turning to cloud computing solutions, whether they need to store data, want to adopt applied analytics or meet growing capacity and speed requirements. The expected returns from successful cloud projects include better customer insights, improved efficiency, cost-effective innovation – and more.", "Customer data contains valuable insights that can only be unlocked with the help of advanced cloud analytics. Real-time data analysis can provide the foundation for improved customer personalisation and proactive engagement across all channels – things that were impossible to achieve with legacy infrastructure.", "While striving to deliver a smoother customer experience, financial institutions still struggle to streamline, automate and link back-office activities to front-end activities. Cloud technology can connect and integrate numerous data and operational systems, allowing staff to access data readily without being chained to a local network. This can speed up processes for more productive analysis and meaningful decision making.", "Financial institutions can use cloud technology to shorten product deployment cycles and simplify product testing. This allows them to test new ideas in real time and to respond rapidly to market demands. Another transformation borne from cloud solutions is open banking, a consumer-approved method of giving a third-party organisation access to their bank’s financial data. This hybrid cloud implementation could help broaden customer options across traditional and non-traditional financial services.", "Every touchpoint of the customer journey counts. Many banks choose cloud-based CRM solutions to manage their client data and interactions in real time. These platforms can record consumer contacts across all communication channels, regardless of where or when they occur. Collecting and analysing the full customer history in this way allows banks to offer superior customer service and ultimately tailor solutions for a better customer experience.", "Using cloud technology, banks can build new solutions that meet changing client demands by analysing how customers engage with financial goods. An advanced digital messaging and communications strategy could create a robust data flywheel for financial institutions by deepening customer insights, enabling better data-driven decisions and strengthening customer engagement.", "The cloud’s framework enables financial services organisations to automate regulatory reports with regulatory strategy and incident handling. In addition, cloud infrastructure provides a more secure environment than legacy systems due to its always up-to-date nature. A safe ecosystem is maintained with three main cloud security solutions: infrastructure security, operations security and application security. Working together, these solutions support financial institutions in detecting suspicious activities before they can have a negative impact.", ", 83 percent of financial service companies already use cloud technologies in some capacity. However, a majority choose hybrid cloud solutions, with fewer organisations opting for single-cloud and multi-cloud. And for many banks, a hybrid strategy works best because it enables them to benefit from both the flexibility and scalability of the public cloud and the protection and control of the private cloud.", "For instance, banks can address security and data privacy concerns by constructing a hybrid cloud where crucial data is kept in a private cloud and computational power is housed in the public cloud.", "The best way for financial institutions to deal with any anticipated cloud challenges is to ensure that their IT infrastructure complies with data privacy and security standards. They must also have solid risk management procedures in place to promptly detect and respond to any possible issues.", "By doing that, they will be able to make the most of all the potential the cloud has to offer."]},
{"title": "AI and Automation: The Digital Differentiator for Life Insurers", "author": "Wanda Rich", "content": ["Truong Hoang Phuc"]}
][
{"title": "FPT Software Showcases Digital Capabilities at Tech-Infused Event", "author": "Staff GBAF Publications Ltd.", "content": [null, "Sponsored Feature Presented by FPT software", null, null, null, null, null, null, null, null, null]},
{"title": "Trends in FinTech in 2022: From artificial intelligence to financial wellness", "author": "maria gbaf", "content": [null, "By ", null, null, null, "Increased investments in digital platforms, composable banking options and innovation", null, null, "Creating a unified customer experience and journey", null, null, "Increased focus on creating an AI structure which enables contextual and connected decision making", null, null, "The power of data", null, null, "Financial wellness and education – humanising the digital experience and rethinking what it means to be customer-centric", null, null, "Expand their line-up of sustainable finance products", null, null, "Open banking and embedded finance", null]},
{"title": "How Artificial Intelligence Enhances Customer Experiences in Banking", "author": "Staff GBAF Publications Ltd.", "content": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]},
{"title": "Research on Digital Transformation Management Consulting Market Research Report with Opportunities and Strategies to Boost Growth- COVID-19 Impact and Recovery", "author": "Reports Markets", "content": [" adds “", " adds “", "Global ", "Global ", "“The final report will add the analysis of the Impact of Covid-19 in this report Digital Transformation Management Consulting industry.”", "“The final report will add the analysis of the Impact of Covid-19 in this report Digital Transformation Management Consulting industry.”", "This report studies the Digital Transformation Management Consulting Market with many aspects of the industry like the market size, market status, market trends and forecast, the report also provides brief information of the competitors and the specific growth opportunities with key market drivers. Find the complete Digital Transformation Management Consulting Market analysis segmented by companies, region, type and applications in the report.", "This report studies the Digital Transformation Management Consulting Market with many aspects of the industry like the market size, market status, market trends and forecast, the report also provides brief information of the competitors and the specific growth opportunities with key market drivers. Find the complete Digital Transformation Management Consulting Market analysis segmented by companies, region, type and applications in the report.", "  Mercer LLC, McKinsey and Company, Quint, SAP, PwC, Ernst and Young Ltd., IBM, RSM, Consulus, ABeam Consulting Ltd., Deloitte, The Boston Consulting Group, Alpha Catalyst Consulting, Cognizant, Ericsson, The IA Group, Bain and Company, Arthur D Little, Accenture PLC, Majesco, Marketify Consulting, FPT Software, KPMG, and A.T. Kearney Inc. ", "  Mercer LLC, McKinsey and Company, Quint, SAP, PwC, Ernst and Young Ltd., IBM, RSM, Consulus, ABeam Consulting Ltd., Deloitte, The Boston Consulting Group, Alpha Catalyst Consulting, Cognizant, Ericsson, The IA Group, Bain and Company, Arthur D Little, Accenture PLC, Majesco, Marketify Consulting, FPT Software, KPMG, and A.T. Kearney Inc. ", " ", " ", null, null, " continues to evolve and expand in terms of the number of companies, products, and applications that illustrates the growth perspectives. The report also covers the list of Product range and Applications with SWOT analysis, CAGR value, further adding the essential business analytics. ", " continues to evolve and expand in terms of the number of companies, products, and applications that illustrates the growth perspectives. The report also covers the list of Product range and Applications with SWOT analysis, CAGR value, further adding the essential business analytics. ", null, null, null, "The Digital Transformation Management Consulting Market research report completely covers the vital statistics of the capacity, production, value, cost/profit, supply/demand import/export, further divided by company and country, and by application/type for best possible updated data representation in the figures, tables, pie chart, and graphs. These data representations provide predictive data regarding the future estimations for convincing market growth. The detailed and comprehensive knowledge about our publishers makes us out of the box in case of market analysis.", "The Digital Transformation Management Consulting Market research report completely covers the vital statistics of the capacity, production, value, cost/profit, supply/demand import/export, further divided by company and country, and by application/type for best possible updated data representation in the figures, tables, pie chart, and graphs. These data representations provide predictive data regarding the future estimations for convincing market growth. The detailed and comprehensive knowledge about our publishers makes us out of the box in case of market analysis.", ":", ":", "This report includes the estimation of market size for value (million USD) and volume (M Units). Both top-down and bottom-up approaches have been used to estimate and validate the market size of Digital Transformation Management Consulting market, to estimate the size of various other dependent submarkets in the overall market. Key players in the market have been identified through secondary research, and their market shares have been determined through primary and secondary research. All percentage shares, splits, and breakdowns have been determined using secondary sources and verified primary sources.", "This report includes the estimation of market size for value (million USD) and volume (M Units). Both top-down and bottom-up approaches have been used to estimate and validate the market size of Digital Transformation Management Consulting market, to estimate the size of various other dependent submarkets in the overall market. Key players in the market have been identified through secondary research, and their market shares have been determined through primary and secondary research. All percentage shares, splits, and breakdowns have been determined using secondary sources and verified primary sources.", null, " ", " ", null, null, " is not just another company in this domain but is a part of a veteran group called ", " is not just another company in this domain but is a part of a veteran group called ", null, "Sanjay Jain          ", "Sanjay Jain          ", "Manager – Partner Relations & International Marketing ", "Manager – Partner Relations & International Marketing ", "  ", "  ", "Ph: +1-352-353-0818 (US)  ", "Ph: +1-352-353-0818 (US)  "]},
{"title": "Can RPA keep the lights on in the high street?", "author": "Staff GBAF Publications Ltd.", "content": [null, "By ", "Giap", null, null, "Leaner operations", null, null, null, "The omnichannel experience", null, null, "Serving the customers", null, null, "Rapid Deployment", null, "Hyper Automation has shifted from an option to a condition of survival,” says Fabrizio Biscotti, research vice-president at Gartner.", null, null, null]},
{"title": "Attracting and retaining ‘Digital Natives’ in the finance industry", "author": "linker 5", "content": [null, "By ", "Hannah Wright,", null, null, null, "Nurturing a flexible, supportive and encouraging environment", null, null, null, null, null, "Using technology to empower young professionals", null, null, null, null, null, null]},
{"title": "Wealth Management Articles", "author": null, "content": []},
{"title": "Wealth Planning Articles", "author": null, "content": []},
{"title": "AI and Automation: The Digital Differentiator for Life Insurers", "author": "Wanda Rich", "content": ["By ", "By ", null, "Technology invasion in the insurance realm is driving radical changes, shifting the industry to a new era of efficiency and customer-centric services. According to a recent study by McKinsey, the greatest impact is likely to come through the introduction of AI and automation solutions, which have been earmarked to transform many of today’s practices, empowering insurance agents, improving efficiencies, reducing costs, and enhancing user experiences. Insurers have already been quick off the mark, embracing AI and automation to deliver bespoke services and seamless customer experience and drive disruptive changes.", "Technology invasion in the insurance realm is driving radical changes, shifting the industry to a new era of efficiency and customer-centric services. According to a recent study by McKinsey, the greatest impact is likely to come through the introduction of AI and automation solutions, which have been earmarked to transform many of today’s practices, empowering insurance agents, improving efficiencies, reducing costs, and enhancing user experiences. Insurers have already been quick off the mark, embracing AI and automation to deliver bespoke services and seamless customer experience and drive disruptive changes.", "The rise of AI has paved the way for lifestyle mobile apps and devices as young, tech-savvy customers nowadays are more interested in their quality of lifestyle and health. Underpinned by AI, these platforms present insurers with a more intimate way to engage with existing and potential customers. Insurance companies now blend into customers’ daily lives to promote knowledge sharing and related programmes to help them best achieve physical and mental well-being while gaining insights to offer personalised products that match customers’ needs. This, in turn, has established a multi-touchpoints engagement channel for insurers to bring a superior customer experience.", "The rise of AI has paved the way for lifestyle mobile apps and devices as young, tech-savvy customers nowadays are more interested in their quality of lifestyle and health. Underpinned by AI, these platforms present insurers with a more intimate way to engage with existing and potential customers. Insurance companies now blend into customers’ daily lives to promote knowledge sharing and related programmes to help them best achieve physical and mental well-being while gaining insights to offer personalised products that match customers’ needs. This, in turn, has established a multi-touchpoints engagement channel for insurers to bring a superior customer experience.", "Next to that, dispensing with the frustrations created by self-services, such as time-consuming paperwork and complicated procedures, the implementation of a super app or customer application in the insurance sector also represents the next level of efficiency and ease of use for the customer. For instance, customers can now check the real-time underwriting status of their applications, or if requested, actions can be sent directly to the customer, i.e., customers can receive medical checkup requests, pending requests, or counter offers from underwriting.", "Next to that, dispensing with the frustrations created by self-services, such as time-consuming paperwork and complicated procedures, the implementation of a super app or customer application in the insurance sector also represents the next level of efficiency and ease of use for the customer. For instance, customers can now check the real-time underwriting status of their applications, or if requested, actions can be sent directly to the customer, i.e., customers can receive medical checkup requests, pending requests, or counter offers from underwriting.", "The fundamental pillars of underwriting—risk assessment and policy premium determination—have long been a mixture of manual analysis and decision-making. To streamline the entire process and reduce reliance on manual labour, insurers are turning to intelligent automation solutions. By combining rules-based task automation with advanced AI components, comprehensive and instantaneous underwriting decisions can be made to enhance the customer experience. It has already been proven that cutting-edge AI/and machine learning (ML) technologies, such as language processing and text mining, and RPA solutions, can increase the Straight-Through Processing (STP) ratio up to 60% in operation.", "The fundamental pillars of underwriting—risk assessment and policy premium determination—have long been a mixture of manual analysis and decision-making. To streamline the entire process and reduce reliance on manual labour, insurers are turning to intelligent automation solutions. By combining rules-based task automation with advanced AI components, comprehensive and instantaneous underwriting decisions can be made to enhance the customer experience. It has already been proven that cutting-edge AI/and machine learning (ML) technologies, such as language processing and text mining, and RPA solutions, can increase the Straight-Through Processing (STP) ratio up to 60% in operation.", "With greater accuracy, not only will this accelerate the decision-making process, but it will also ensure judgments are based on a broad data-driven assessment. Leveraging rich historical data from a wide range of sources, such as past health records and lifestyle habits, insurers can train AI-based models to produce accurate decisions for new applications. As the frequency of cases increases, the system learns from these instances to improve its decision-making algorithm.", "With greater accuracy, not only will this accelerate the decision-making process, but it will also ensure judgments are based on a broad data-driven assessment. Leveraging rich historical data from a wide range of sources, such as past health records and lifestyle habits, insurers can train AI-based models to produce accurate decisions for new applications. As the frequency of cases increases, the system learns from these instances to improve its decision-making algorithm.", "The claims processing, on the other hand, is typically complex, time intensive, and, at times, a frustrating process for both companies and customers, but its importance is unquestionable. A recent study by EY found that 87% of customers would renew their insurance with an insurer if their claim’s processing experience had been positive and speedy.", "The claims processing, on the other hand, is typically complex, time intensive, and, at times, a frustrating process for both companies and customers, but its importance is unquestionable. A recent study by EY found that 87% of customers would renew their insurance with an insurer if their claim’s processing experience had been positive and speedy.", "To this end, AI and ML algorithms can facilitate and speed up the claims handling process without human intervention. ML can help determine aspects of claims such as image recognition, data unification, data analysis, and flag fraud, with ML algorithms typically analysing images and sensors along with an insurer’s historical data, helping to speed up settlements. Meanwhile, tools like OCR are being used to automate and enhance the transparency of claims processing regarding data entry, document classification, and information extraction.", "To this end, AI and ML algorithms can facilitate and speed up the claims handling process without human intervention. ML can help determine aspects of claims such as image recognition, data unification, data analysis, and flag fraud, with ML algorithms typically analysing images and sensors along with an insurer’s historical data, helping to speed up settlements. Meanwhile, tools like OCR are being used to automate and enhance the transparency of claims processing regarding data entry, document classification, and information extraction.", "It’s also just as important to remember that while we can tout the improvements AI can provide, insurers must also not forget the value of a great customer experience is human interaction.  Some of us are sold on the idea of a reliable, fast, and accurate digital service, while others still yearn for the human touch or just someone to speak to in an emergency. A balanced approach or a middle ground between a digital app and emergency assistance from skilled claim professionals will go a long way to building trust and loyalty.", "It’s also just as important to remember that while we can tout the improvements AI can provide, insurers must also not forget the value of a great customer experience is human interaction.  Some of us are sold on the idea of a reliable, fast, and accurate digital service, while others still yearn for the human touch or just someone to speak to in an emergency. A balanced approach or a middle ground between a digital app and emergency assistance from skilled claim professionals will go a long way to building trust and loyalty.", "The launch of AI-powered labour-saving tools like digital agent platforms, all-in-one apps, or chatbot assistants has helped insurers streamline traditionally slow workflow and free them from time-consuming administrative tasks, such as extracting information from documents, prioritising emails, and collating records of conversations. Especially, chatbot assistants establish an effective engagement channel thanks to their ability to provide recommendations for the right actions or products to help insurance agents win opportunities. This, in turn, allows insurance agent to do what they are best at: building better relationships with their customers and giving them the peace of mind that they have the right protection in place should the worst happen. It’s truly the best of both worlds: the customer gets a hyper-personalised service bolstered by the convenience of technology.", "The launch of AI-powered labour-saving tools like digital agent platforms, all-in-one apps, or chatbot assistants has helped insurers streamline traditionally slow workflow and free them from time-consuming administrative tasks, such as extracting information from documents, prioritising emails, and collating records of conversations. Especially, chatbot assistants establish an effective engagement channel thanks to their ability to provide recommendations for the right actions or products to help insurance agents win opportunities. This, in turn, allows insurance agent to do what they are best at: building better relationships with their customers and giving them the peace of mind that they have the right protection in place should the worst happen. It’s truly the best of both worlds: the customer gets a hyper-personalised service bolstered by the convenience of technology.", "In an ever-changing digital landscape, there will always be challenges for insurers to adapt and overcome. AI is by no means always correct, as it only supports automated decision-making from learned historical data, which can be biased, inadequate, and incomplete. While the answer can be found through regular audits and algorithm updates, remember the human touch to ensure transparency and accuracy.", "In an ever-changing digital landscape, there will always be challenges for insurers to adapt and overcome. AI is by no means always correct, as it only supports automated decision-making from learned historical data, which can be biased, inadequate, and incomplete. While the answer can be found through regular audits and algorithm updates, remember the human touch to ensure transparency and accuracy.", "The future of insurance lies in the hands of AI-powered automation as we embrace these technologies. The companies that seize the opportunity will deliver faster, more accurate, personalised services to their customers. Expect a few stumbles along the way. AI-powered automation will set the standard for excellence in the insurance industry.", "The future of insurance lies in the hands of AI-powered automation as we embrace these technologies. The companies that seize the opportunity will deliver faster, more accurate, personalised services to their customers. Expect a few stumbles along the way. AI-powered automation will set the standard for excellence in the insurance industry.", null, "FPT Software, a subsidiary of FPT Corporation, is a global technology and IT services provider headquartered in Vietnam, with $1 billion in revenue (2023) and over 30,000 employees in 30 countries.", "FPT Software, a subsidiary of FPT Corporation, is a global technology and IT services provider headquartered in Vietnam, with $1 billion in revenue (2023) and over 30,000 employees in 30 countries.", "The company champions complex business opportunities and challenges with its world-class services in Advanced Analytics, AI, Digital Platforms, Cloud, Hyperautomation, IoT, Low-code, and so on. It has partnered with over 1,000+ clients worldwide, 91 of which are Fortune Global 500 companies in Aviation, Automotive, Banking, Financial Services and Insurance, Healthcare, Logistics, Manufacturing, Utilities, and more. For more information, please visit", "The company champions complex business opportunities and challenges with its world-class services in Advanced Analytics, AI, Digital Platforms, Cloud, Hyperautomation, IoT, Low-code, and so on. It has partnered with over 1,000+ clients worldwide, 91 of which are Fortune Global 500 companies in Aviation, Automotive, Banking, Financial Services and Insurance, Healthcare, Logistics, Manufacturing, Utilities, and more. For more information, please visit"]},
{"title": "Share Class Articles", "author": null, "content": []},
{"title": "Cloud Banking: How Cloud Computing is Transforming the Financial Services Industry", "author": "Staff GBAF Publications Ltd.", "content": [null, "By ", "Trung Nguyen Hoang", null, "Cloud is more than just a technology buzzword. It has become a major catalyst for enterprise business transformation, and a potential game changer for how banks and financial services organisations will operate in the future.", null, null, null, null, "Better customer insights", null, null, "Enhanced efficiency", null, null, "Driving innovation", null, null, "Seamless customer service", null, null, "Stronger customer engagement", null, null, "Better fraud detection", null, null, "The future is in the cloud", null, null, null, null]}
]