[
{"Title": "​FPT Telecom gets new chairman", "Author": "Anh Tu", "Content": ["He will not join the board of directors of FPT Telecom Joint Stock Company (FPT Telecom) for the 2023-28 term.", "After becoming chairman in March 2020, Tien, 54, led FPT Telecom past the numerous challenges posed by the Covid pandemic.", "In 2020-22 the telecom operator’s revenues increased from VND11.46 trillion ($490 million) to 14.7 trillion and profits from VND 1.6 trillion to VND2.25 trillion.", "It also launched many new products and services such as FPT Camera, Foxpay e-wallet and FPT Play, an OTT service offered directly to viewers via the Internet.", "Tien started working for FPT Group in 1993.", "He has held many leadership positions in the corporation such as chairman of FPT Software Co. Ltd (2012-20), general director of FPT Hoa Lac Hi-Tech Park Development Co. Ltd (2007-12) and general director of FPT Distribution Co. Ltd (2003 - 08).", "Replacing him as FPT Telecom chairman is Hoang Viet Anh.", "FPT Group said the changes are in line with its agenda of rotating senior leaders.", "Anh also joined FPT in 1993 as a programmer when he was still a student.", "He too has held many senior management positions, working as general director of FPT Telecom since early 2018 and currently also holding the position of deputy general director of FPT Corporation and chairman of FPT Digital Transformation Consulting Company.", "Nguyen Hoang Linh replaces hun as FPT Telecom general director.", "Linh has worked for 15 years at FPT Telecom and is currently deputy general director."]},
{"Title": "FPT plans $87M undersea cable", "Author": "Anh Tu", "Content": ["Its subsidiary FPT Telecom will present the plan to shareholders for approval at its annual general meeting Tuesday.", "The company will invest 30% of the cost from its own resources and borrow the rest from banks.", "It said it expects to recoup the investment in eight years and 10 months.", "The 6,000-kilometer Asia Link Cable links Hong Kong, mainland China, the Philippines, Brunei, and Singapore and has a capacity of 18 terabits per second.", "FPT Telecom will set up a connecting station in Da Nang City.", "The company’s CEO, Nguyen Van Khoa, had said earlier this month that investing in a undersea cable would be the main priority for the company this year, and it would give users a \"different\" experience.", "Vietnam’s five undersea cables regularly face issues, and fixing them often takes a long time as they pass through other countries’ territories.", "State-owned telecom firm Viettel is also set to lay an undersea cable this or next year. To cost $290 million, Asia Direct Cables will run 9,800 kilometers and have a capacity of more than 140 tbps.", "It will have almost three times the capacity of the Asia Pacific Gateway (54.8 tbps) which Vietnamese telecom firms are using.", "Next year another state-owned telecom firm, VNPT, plans to install the SJC2 cable with a capacity of 18 tbps."]},
{"Title": "FPT buys stake in US computer vision, AI company", "Author": "Minh Son", "Content": ["The partnership marks an important advancement in AI collaboration between Vietnam and the U.S., FPT said in a press release without disclosing details about the deal.", "Subsidiary FPT Software and Landing AI will explore the possibility of opening a dedicated engineering center in Vietnam to develop AI expertise.", "The founder and CEO of the U.S. company, Andrew Ng, said: \"There is tremendous optimism about what we could achieve together for the future generations driven by AI innovations.\"", "FPT chairman Truong Gia Binh said: \"\"This collaboration will open up a new era for AI development in Vietnam and bring new opportunities for our country’s future generations to excel in high-tech fields.\"", "FPT considers AI a spearhead for digital transformation in Vietnam and globally. The corporation has an AI workforce of 500 experts and 50 with PHDs/masters, and an ecosystem of 20+ AI-enabled products and services with over 200 million monthly end-users per month."]},
{"Title": "FPT Telecom becomes Cloudflare's official distributor", "Author": "Thy An", "Content": ["The cooperation was announced at FPT Tower, Hanoi, on September 5, with the attendance of representatives from both sides, including Vu Anh Tu, CTO of FPT Corporation; Tran Thanh Hai, CTO of FPT Telecom; Tran Hai Duong, Chairman and CEO of FPT Telecom International (FTI); Do Anh Tuan, Director of FPT Telecom International’s Business Division; Karun Ruamsuke, Cloudflare's Head of Indochina, Thailand, PHL; Mai Thi Ngoc Tu, Cloudflare's Indochina Sales Lead; and Tan Ghim Hwee (Ghims), Cloudflare's ASEAN Channel Account Manager.", "FPT Telecom and Cloudflare’s representatives at the announcement event in Hanoi, on September 5. Photo courtesy of FPT Telecom", "There were also solution experts and many guests from government agencies and senior leaders in technology and financial companies.", "Duong said that FPT Telecom has officially become Cloudflare's distributor in Vietnam, Laos, and Cambodia. This marks a crucial step forward in the company's Go Global strategy.", "The event also plays an important role in helping businesses in the region optimize their website's access speed, enhance security, and reduce operation costs.", "FPT Telecom, with a large customer base and proven ability to deploy cloud computing services through many typical case studies in the banking and finance sectors, is capable of advising on and deploying security solutions for all customers in all industries.", "Becoming Cloudflare's first official focused distributor in Vietnam, Laos, and Cambodia also helps FPT Telecom deliver the best support to customers in terms of technology and cost optimization.", "Accordingly, FPT Telecom will provide enterprises with two main product groups: Cloudflare SME for small and medium enterprises with optimal performance and cost; and Cloudflare Enterprise, which provides the full range of Cloudflare product groups (network, application, zero trust, developer services) and tailor-made solutions to meet the unique service requirements of customers.", "Vu Anh Tu, CTO of FPT Corporation, sharing during the seminar \"The importance of information security for Vietnamese businesses\". Photo courtesy of FPT Telecom", "Karun, a Cloudflare representative, also shared his sincere thanks and affirmed the importance of the solid cooperative relationship between Cloudflare and FPT Telecom. Not only strengthening its position as a leading telecommunications supplier but also bringing advanced cloud technology and cloud security solutions to customers.", "FPT Telecom is committed to bringing various benefits and excellent experiences to customers using services from Cloudflare based on their strengths in deploying and providing solutions for large customers; having connections with network operators in Vietnam with the largest PoP placed at FPT Telecom; owning an experienced technician team with more than 40 Cloudflare certified engineers who are available to support anytime, anywhere; and being adequately qualified to be Cloudflare's Level 1 support in Vietnam.", "Mai Thi Ngoc Tu, Cloudflare's Indochina Sales Lead, shared about the field of cooperation between the two businesses. Photo courtesy of FPT Telecom", "Established in 2009 with headquarters in San Francisco, California, USA, Cloudflare is a technology company specializing in security solutions, DDoS attack prevention from layer 3 to layer 7, and global network infrastructure.", "Cloudflare is one of the leading security and privacy service providers in the industry with the largest infrastructure capacity compared to any similar providers, with infrastructure in over 300 cities in over 100 countries, including China with more than 30 POPs.", "The company aims to build a more sustainable and secure Internet environment for everyone. It meets the flexible requirements of any customer with diverse solutions such as security, optimization, and acceleration for websites and applications; provides an all-in-one solution for network scalability and security; data storage; and developer timeline improvement.", "FPT Telecom Joint Stock Company (FPT Telecom) is one of the leading telecom and Internet service providers in the region. Established on January 31, 1997, the Online Service Center was founded by four members with the first Internet product from Vietnam, called Vietnamese Wisdom (TTVN).", "The product is considered the foundation for Internet development in Vietnam.", "With the pioneering mission of bringing the Internet and connection to the Vietnamese people, along with the great desire for every Vietnamese family to use at least one service of the company, FPT Telecom is making efforts to implement the strategy \"Bringing the Best Experience for Customers\" on the basis of promoting the core cultural value of \"customer-centric\" and the foundation of FPT technology power, thereby pioneering to become a digital service provider with the most outstanding customer experience nationwide.", "FPT Cloud Hub is an ecosystem of applications and services surrounding cloud computing developed by FPT Telecom International Co., Ltd. (FTI).", "The company provides advanced, quality solutions specifically for businesses in Vietnam and the region, with the top criteria being: increasing the application experience of businesses and their customers; optimizing costs of equipment, infrastructure, and cloud computing platforms; and supporting the building and conversion of systems from classic platforms to advanced cloud computing infrastructure."]},
{"Title": "FPT invests in third US company in 2023", "Author": "Dat Nguyen", "Content": ["FPT expects the investment to double its revenues from product engineering services – which include hardware and software development – in the Americas in the next two years.", "The Colorado state-based Cardinal Peak has 100 engineers in the U.S.", "Earlier this year FPT had acquired the IT services division of tech firm Intertec International and stakes in Landing AI, a leading computer vision and AI software company, in the U.S.", "It has committed to investing US$100 million in the Americas this year.", "The Americas are among FPT's largest overseas markets, and it has 14 offices across the U.S., Canada and Latin America - including nearshore facilities in Colombia, Costa Rica and Mexico - and employees in 28 U.S. states and provinces.", "Since 2014 FPT has been acquiring technology companies in several countries including Slovakia, the U.S., and Japan, to strengthen its consulting capabilities, expand its customer base and increase overseas revenues.", "Mergers and acquisitions play an important role in FPT's global strategy and contribute to achieving the goal of achieving $1 billion in sales from information technology services to foreign markets.", "In the first nine months of the year, revenue from this segment brought FPT more than VND17.6 trillion ($724.43 million), an increase of 31% year-on-year. Pre-tax profit reached VND2.88 trillion, up 30.2%."]},
{"Title": "FPT Retail to enter mobile virtual network market in 2024", "Author": "Anh Tu", "Content": ["FPT Retail, an associate of the IT giant FPT, is set to first provide mobile virtual network service to its employees by the end of November, and then to the public by the start of next year, according to the company's announcement on Wednesday.", "Unlike traditional network operators, mobile virtual network operators do not own network infrastructure, opting instead to provide services by buying mobile data at wholesale rates from operators who have the infrastructure and selling them to consumers at retail prices.", "Additionally, regulators do not impose many operating limits on mobile virtual network operators, as opposed to the limited licenses that traditional operators get. For consumers, these services are practically identical.", "Vietnam now has four mobile virtual network operators, with iTel and Reddi working with mobile network operator Vinaphone, and Local and VnSky working with MobiFone."]},
{"Title": "FPT profits rise by 19.5% as overseas business remains strong", "Author": "Minh Son", "Content": ["They represent year-on-year increases of 19.5% and 22.4%.", "Its information technology business continued to play a key role, accounting for 46% of the profits and 59% of the revenues.", "The segment’s revenues and profits increased by 25.7% and 20.8%.", "Revenues from foreign markets, including Japan, surged by 31% to VND17.626 trillion, and profits by 30% to VND2.878 trillion.", "Domestically, there were challenges due to declining demand from corporate customers, and profits fell by 34% to VND250 billion though revenues were up 10.2% to VND4.9 trillion.", " said it would continue to promote cooperation with the government, ministries, provinces and cities, and foreign businesses.", "It has signed agreements with nearly 30 cities and provinces for digital transformation.", "The company’s telecommunications division reported revenues of VND11.278 trillion, up 10%, and profits of VND2.217 trillion, up 15%.", "The increase in demand for information technology training boosted the revenues of FPT’s education division by 43% to VND4.435 trillion."]},
{"Title": "FPT plans $100M investments in US", "Author": "Minh Son", "Content": ["FPT Chairman Truong Gia Binh announced the investments at the Vietnam - U.S. Summit on Innovation and Investment in Hanoi Monday, adding that its projects will come with a 1,000-strong workforce.", "The corporation expects to create more than 3,000 jobs by 2028 and generated revenues of $1 billion in the U.S. market by 2030, Binh said at the summit, held during President Joe Biden's state visit to Vietnam and attended by Vietnam's Minister of Planning and Investment Nguyen Chi Dung and the U.S. Secretary of State Antony Blinken.", "FPT also announced its comprehensive strategic partnership with Landing AI, a computer vision platform and AI software company in the Silicon Valley to boost AI adoption at FPT Education.", "Joining the U.S. market in 2008, FPT has partnered with more than 300 businesses, including more than 30 in Fortune 500.", "FPT Chairman Truong Gia Binh (R) talks with a U.S. business leader at the Vietnam - U.S. Summit for Innovation and Investment in Hanoi, September 11, 2023. Photo by FPT", "At the summit, Binh asked for support from the U.S. government to develop the semiconductor industry in Vientam.", "He proposed that the U.S. invest in training 30,000 to 50,000 semiconductor experts to Vietnam and provide FPT with funds for training semiconductor and AI engineers.", "\"On behalf of Vietnamese businesses, we at FPT want the U.S. government to have support policies to turn Vietnam into a country with a semiconductor ecosystem,\" Binh said.", "President Biden and Vietnamese Prime Minister Pham Minh Chinh agreed on Monday to turn technology, innovation, and investment into an important pillar of the countries' comprehensive strategic partnership.", "Biden said the U.S. will cooperate and support Vietnam to seize opportunities in technology, suggesting Vietnam and its businesses continue to promote development in science and technology, innovation, semiconductor industry, green transformation, climate change response and human resources training, and to participate more deeply in regional and global value chains.", "FPT established FPT Semiconductor last year with plans to distribute 25 million microchips globally in 2024 and 2025."]},
{"Title": "FPT Retail debuts mobile virtual network in Vietnam", "Author": "Luu Quy", "Content": ["Known for operating the FPT Shop chain and being a subsidiary of the tech giant FPT, FPT Retail does not have its own network infrastructure but leases network services from MobiFone and offers subscriptions to consumers at its own pricing.", "With an established ecosystem that includes over 800 FPT Shops across 63 Vietnamese cities and provinces, FPT Retail is poised to leverage its substantial retail presence. These shops annually sell around 1.5 million smartphones and various electronic gadgets.", "The new network will be infused with advanced features like cloud computing and artificial intelligence, targeting a demographic keen on cutting-edge technologies, specifically younger consumers. It also aims to cater to businesses and households.", "FPT Retail's strategy involves incorporating various FPT services into the network, enhancing the overall user experience, said CEO Hoang Trung Kien.", "The introduction of this network adds to the existing roster of mobile virtual network operators in Vietnam, which currently includes iTel, Wintel, Local, and VNSKY.", "As of early 2023, these operators collectively serviced about 2.56 million subscribers, accounting for 2.1% of the total Vietnamese market.", "The majority of the market is still dominated by five telecom firms that own network infrastructure, namely VinaPhone, Viettel, MobiFone, Vietnammobile, and Gtel."]},
{"Title": "Vietnam tech giant says paying AI, data engineers up to $400,000 a year", "Author": "Khuong Nha", "Content": ["During a meeting in Da Nang leaders, Pham Minh Tuan, FPT's Executive Vice President, said that the largest expense of the corporation currently is employee salaries.", "\"Every day, FPT spends over US$2 million to pay salaries to more than 30,000 people,\" he said.", "The average income of new graduates at FPT is about VND10 million per month.", "AI and data analysis experts have an income comparable to engineers in Europe and Japan, and about 10% lower than in France.", "\"The maximum amount is uncertain, but there are Vietnamese engineers at the corporation earning billions per month, averaging more than VND10 billion per year,\" said Tuan.", "He noted that this is the salary the corporation pays to Vietnamese engineers working in Vietnam. FPT does not set a salary cap but pays according to ability, based on performance.", "If engineers are skillful, and able to create useful tools and software, they can increase their income. At times, the salaries of AI and Data engineers at FPT can even exceed those of their CEO, Tuan said.", "Tuan highlighted the strengths of Vietnamese engineers as young, dynamic, and proficient in technology.", "However, there are also areas where Vietnamese lack experience compared to international personnel, such as in finance, banking, and telecommunications.", "Therefore, the current structure of the corporation includes about 10% of the personnel as foreigners. FPT aims to increase this to 20% within the next three years.", "\"The goal is to leverage global intelligence to build a proficient team capable of fully managing a project,\" he said.", "Tuan said in the future, AI could be a decisive weapon for the success and longevity of Vietnamese software companies as well as for securing a long-term position for Vietnamese engineers.", "According to the annual report by human resources technology platform TopCV released last year, the IT and software sector has the second highest recruitment demand in Vietnam, after business and sales. Depending on the sector, the salaries of Vietnamese engineers also vary.", "With over five years of experience, a website programmer has an average monthly salary of VND36-48 million, while the salary for a security specialist is VND26-42 million, and a data management specialist is VND30-50 million.", "According to statistics released late last month by Levels.fyi, a company which compiles data about the salaries and bonuses of tech workers, each AI software engineer in the U.S. currently has a median salary of $300,000 per year, while programmers and software engineers not specializing in artificial intelligence are paid around $100,000.", "\"As AI shakes up much of the industry, it also raises the bar for engineering compensation in 2024,\" Levels.fyi analyst Alina Kolesnikova said.", "The wage disparity between AI and non-AI engineers, which was around 30% in mid-2022, has now widened to nearly 50%, she added."]},
{"Title": "FPT and Nvidia to build $200M AI factory in Vietnam", "Author": "Dat Nguyen", "Content": ["The factory, which will serve as a sovereign cloud, will not produce hardware but instead will focus on AI research and development using Nvidia’s latest technologies, including Nvidia AI Enterprise software and frameworks and Nvidia H100 Tensor Core Graphic Processing Units, FPT said in an press release Tuesday as its leaders sign the partnership with their Nvidia counterparts in Hanoi.", "The factory will create applications and solutions on generative AI (a type of AI that can create new content and ideas), autonomous driving and green transformation.", "\"This empowers FPT to realize the vision of transforming Vietnam into an AI nation and accelerating the adoption of AI applications in Asia, including but not limited to Vietnam, Japan, and Korea.\"", "FPT chairman Truong Gia Binh said that the company’s vision is to \"turn Vietnam into an AI hub of the world.\"", "Nvidia vice president of worldwide AI Initiative Keith Strier said: \"By accelerating innovation in healthcare, agriculture, climate, manufacturing, and more, AI has the potential to improve lives and strengthen the economies of every nation.\"", "\"FPT is working with Nvidia to empower organizations across Vietnam to drive transformation, helping the country become an AI nation,\" he added.", "FPT plans to incorporate Nvidia's training content into university and high school curricula to develop high-tech human resources. The corporation wants to have at least 30,000 students in the program within five years.", "As part of the collaboration, FPT has joined the Nvidia Partner Network as a Service Delivery Partner and aims to become a Global Systems Integrator, leveraging the full potential of Nvidia's cutting-edge products and technologies to develop bespoke cloud services, hardware, software, and most importantly, generative AI solutions.", "The two companies will develop cloud gamming in Vietnam through Nvidia’s service GeForce Now.", "Strier on Monday had a meeting with the Minister of Planning and Investment, Nguyen Chi Dung, which reinforced the efforts in building and developing Vietnam's semiconductor and AI ecosystem.", "A source told ", " that Nvidia's purpose for this visit to Vietnam is to work with parties to establish a research, development, and training center for AI, install supercomputers, and possibly relocate a portion of graphic processing units production for supercomputers to Vietnam.", "Nvidia CEO Jensen Huang in December last year visited Japan, Singapore, Malaysia and Vietnam to look for potential partners. He emphasized that Asia is the new global tech hub and wants to expand his company’s presence here."]},
{"Title": "FPT seeks to enter auto industry by buying 'any' automotive technology company", "Author": "Minh Son", "Content": ["Chairman Truong Gia Binh told shareholders at the company’s annual general meeting Wednesday that mergers and acquisitions are among FPT’s priorities, especially in the auto industry.", "The global auto industry is now \"confused\" as traditional manufacturers make products that are \"too mechanical\" while electric vehicle companies focus too much on software, he said.", "The industry needs a company that understands both software and auto manufacturing, he said.", "\"This is a rare opportunity. They need companies that understand cars, software and security.\"", "FPT is capable of handling the technology and now needs to acquire an automaker, he added.", "It established FPT Automotive last year to provide software solutions to automakers, hired 1,500 engineers and targets revenues of ", " by 2030.", "FPT has been active in the M&A market, acquiring stakes in four tech companies in the U.S. and France last year and buying out Japan’s Next Advanced Communications this year.", "The company, which reported overseas revenues of $1 billion from IT services last year, has set its sights on more acquisitions in South Korea, Singapore and Europe.", "This year it targets total revenues of VND61.85 trillion ($2.47 billion) and pre-tax profits of VND10.88 trillion, both 18% higher than in 2023.", "It aims to expand its semiconductor, AI, cloud, and cybersecurity offerings.", "It has received orders to deliver 70 million chips by 2025, which would generate revenues of around $10 million, deputy CEO Nguyen The Phuong said.", "FPT designs the chips and hires foundries in Taiwan and Japan to make them. The microchips would be sold at reasonable price, he added."]},
{"Title": "FPT contributes significantly to Vietnam's growth: expert", "Author": "The Dan", "Content": ["Murthy, who is considered \"India's Bill Gates,\" and Truong Gia Binh, Chairman of FPT, had a talk at F-Ville 3, Hoa Lac Hi-Tech Park, on Monday.", "The event was part of Murthy's series of visits and working activities in Vietnam from May 19–23.", "At the event, Murthy assessed Vietnam as the only country in Southeast Asia that can create a software service business like FPT.", "According to him, FPT and Vietnam in general are unique.", "In the early years of its establishment, FPT's founders encountered many difficulties.", "However, thanks to great leadership as well as a little luck, the group has risen and achieved many successes.", "He believes that FPT and Vietnam have no rivals; and that no other country can be so brave and aspirational.", "\"With current resources and luck, FPT will reach the milestone of US$2 billion in IT service revenue from foreign markets, faster than the first milestone of US$1 billion,\" he said.", "He also pointed out that Infosys took 23 years, from 1981 to 2004, to reach the first milestone, 23 months to reach US$2 billion, and 11 months to reach US$3 billion.", "\"I have great confidence in FPT and Vietnam. No other country can match the courage and ambition you have shown. I believe that if Infosys can do it, Vietnam and FPT can do it too. I believe that FPT is and will contribute significantly to Vietnam's future growth,\" he said.", "In 2023, after 24 years of globalization, FPT reached the milestone of $1 billion in IT service revenue from foreign markets.", "The group, for the first time, has a customer with a sales scale of over US$200 million.", "This customer, headquartered in the US, is the only company in the world that provides a full set of solutions for auto distributors, such as inventory, marketing, sales, after-sales, and operations.", "Narayana Murthy (L) and Truong Gia Binhshared many common perspectives on business leadership at a meeting on May 20, 2024. Photo by VnExpress/Ngoc Thanh", "The Indian billionaire shared the secret to successfully starting a business, as well as his business leadership experience.", "He said that the idea of starting a business started with the desire to eradicate poverty in his hometown.", "After spending some time in France, he returned to India to establish a business. However, his first attempt failed because he forgot one of the most important principles of market assessment.", "In 1981, he was determined to start again, establishing Infosys with a capital of US$250 targeting the software services market, the one that, according to him, would have great demand to realize his dream of creating jobs and solving poverty problems in India.", "Murthy said that Infosys and FPT have something in common as they are both startups, dreamers, and working hard to turn that idea into reality.", "\"Robert Kennedy once said that most people see things as they are and wonder why, but I dream of things that never were and say, why not?\" Murthy said.", "Sharing the secret to successful business leadership, he said that, at work, leaders and employees are not friends, not until they leave the office.", "\"Respect from customers will help businesses achieve high profits, and with trust from customers, the company will attract employees from other businesses,\" he said.", "\"If you want to invest in the long term, businesses need to achieve this.\"", "He added that if people who do business want the government's trust, they must also become one of the most respected businesses.", "From Infosys's practical experience, Murthy concluded that to be successful, businesses need to ensure three important factors: sales, financial control, and human resources.", "\"If we cannot sell products, the company will have no revenue. Without revenue, the company cannot operate,\" he said.", "When there is revenue, it must be ensured that all costs are controlled.", "In fact, many corporations are profitable, but costs increase, and losses lead to losses. The leader said that financial control plays an important role. They must ensure costs are adequate and justified in accordance with business activities; in addition, they must always be less than revenue.", "Narayana Murthy pointed out that businesses must ensure costs are adequate and justified in accordance with business activities. Photo by VnExpress/Ngoc Thanh", "Murthy believes that businesses also need to create favorable conditions and empower employees to feel happy by giving them freedom, evaluating them, rewarding them, and retaining them.", "\"My experience is that money is not the most important thing, but human resources want respect and appreciation for their abilities,\" he said.", "Murthy is an information technology legend and was compared to India's Bill Gates when he took Infosys from an unknown company into a symbol of the country's software industry.", "In 1999, Infosys became the first Indian company listed on the US Nasdaq.", "In 2023, it achieved revenue of over US$18 billion, had 320,00 employees, was present in 50 countries globally, and had a market value of over US$70 billion.", "According to Forbes' 2023 statistics, Murthy owns assets worth $US4.1 billion, ranking 711th among the richest people on the planet."]},
{"Title": "FPT honored in multiple categories at Asia technology award", "Author": "Thy An", "Content": ["The technology award attracts thousands of organizations, individuals, and businesses across 24 economies in the Asia-Pacific area. The event drew nearly 600 delegates, including worldwide government officials and IT industry leaders.", "Annually, the ASOCIO Awards assess over 10,000 submissions to select 52 entities from nine countries and territories in the region that effectively integrate technology into various aspects of life, contributing to the formation of a digital transformation ecosystem.", "A representative from FPT (2nd, R) stands alongside top business heads from the Asia-Pacific region at the ASOCIO 2023 Awards ceremony. Photo courtesy of FPT", "In the 2023 edition, FPT Smart Cloud, the sole technology company from Vietnam, was honored in the \"Start-up Award\" category alongside the largest tech companies from countries in the region, such as Japan, South Korea, Thailand, and Malaysia.", "The company received high praise from the judging panel for its innovative and breakthrough technology products and services, including its impressive achievements that bring value to users and society.", "FPT Smart Cloud has developed an ecosystem of over 80 innovative AI, cloud, and data solutions with international standards, from infrastructure to applications.", "These products solve various challenges, facilitate flexible digital transformation, optimize costs, and enhance security.", "It also collaborates with over 3,000 enterprise customers in 15 countries worldwide, serving more than 200 million users monthly.", "Doan Dang Khoa (C), Deputy CEO of FPT Smart Cloud, at the award ceremony. Photo courtesy of FPT", "In addition, the VioEdu Online Education System (FPT IS) was in the EdTech Award category. The VioEdu system impressed the judging panel with its technological innovations, content quality, and overall growth.", "VioEdu boasts over 17 million users, with 63 million students participating in knowledge-based activities, earning it a spot among the top 8 most prominent keywords on Google Search in 2021. This achievement positions VioEdu as one of the leading EdTech platforms in Vietnam in terms of growth rate.", "Nguyen Viet Cuong (C), CTO of VioEdu, receives the EdTech Award 2023 on behalf of the team. Photo courtesy of FPT", "The system features over 10,000 animated lecture videos, 1 million high-quality learning materials aligned with the Ministry of Education and Training curriculum, and engaging gamifying activities.", "Utilizing 4.0 technologies such as AI, Adaptive Learning methods, and big data, VioEdu automatically analyzes strengths and weaknesses, provides customized learning roadmaps, optimizes study time, and facilitates rapid student progress.", "Before this, FPT Smart Cloud had received numerous awards, including being the only Asian company honored by the Stevie Awards in the Best Innovative Technology Company category, the Gold Award at the International Business Awards (IBAs) in the Cloud Platform category, and the Gold Award for \"Make in Vietnam\" in the Outstanding Digital Product for the Digital Economy category...", "ASOCIO was established in 1984 in Tokyo, Japan, and is currently one of the most active international trade organizations in the Asia-Pacific region, with 24 associations representing over 10,000 multinational enterprises.", "The ASOCIO Award, a prestigious information technology award, has been organized by ASOCIO since 2003. The judging panel consists of 15 members, reputable IT experts from countries within the region, with Brian Shen, Chairman of the Asia-Oceania Computing Industry Organization, serving as the chairman.", "Prof. Dr. Truong Gia Binh, Chairman of FPT, was honored by ASOCIO in 2013. The organization also recognized FPT IS in 2017 and FPT University in 2018. In 2022, ASOCIO awarded Base Enterprise and FPT Polytechnic College."]},
{"Title": "FPT makes first company acquisition in Japan", "Author": "Dat Nguyen", "Content": ["The acquisition of IT services firm Next Advance Communications enables FPT to benefit from a talent pool of 300 engineers with expertise in technology, architecture design, system planning, and other areas, the company said in a statement Friday.", "FPT hopes to achieve US$1-billion revenues in Japan by 2027 and have foreigners make up more than half of its payroll there.", "The acquisition of the 13-year-old company reflects FPT’s commitment to assisting Japanese businesses achieve digital transformation and green transformation.", "Since 2014 FPT has completed multiple mergers and acquisitions ", " and Europe.", "In Japan, it recently formed a joint venture with Konica Minolta and made a strategic investment in LTS Inc.", "FPT has a nearly two-decade presence in the Japanese market with FPT Japan being one of the country’s largest foreign-invested tech firms in terms of human resources.", "With 2,900 onsite employees, nearly 15,000 employees working overseas and 16 local offices and innovation hubs, FPT Japan has provided services to over 450 clients globally."]}
]